In [76]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

In [77]:
time = pd.read_csv(r"E:\Jupyter Notebooks\messages.csv")
date = pd.read_csv(r"E:\Jupyter Notebooks\orders.csv")

In [78]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [79]:
time.tail()

                    date                                                msg
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

In [80]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [81]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [82]:
# date and time column values are of type object (sort of strings) by default in pandas df

### Dealing with dates

In [83]:
date['date'] = pd.to_datetime(date['date'])

In [84]:
type(date['date'])

pandas.core.series.Series

In [85]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### Extract year

In [86]:
date['year'] = date['date'].dt.year

In [87]:
date.sample()

          date  product_id  city_id  orders  year
839 2018-09-23        5284       25       1  2018

#### Extract month

In [88]:
date['month'] = date['date'].dt.month

In [89]:
date['month_name'] = date['date'].dt.month_name()

#### Extract day

In [90]:
date['day'] = date['date'].dt.day

#### Extract day of the week

In [91]:
date['dayofweek'] = date['date'].dt.dayofweek

In [92]:
date.sample()

,date,product_id,city_id,orders,year,month,month_name,day,dayofweek
45,2019-07-01,1533,18,57,2019,7,July,1,0

#### Extract name of the day of the week

In [94]:
date['dayname'] = date['date'].dt.day_name()

In [97]:
# is Weekend?
date['weekend'] = np.where(date['dayname'].isin (['Saturday','Sunday']), 1, 0)

In [100]:
date[date['dayname'] == 'Saturday']

,date,product_id,city_id,orders,year,month,month_name,day,dayofweek,dayname,weekend,week
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33
8,2019-06-29,3699,3,15,2019,6,June,29,5,Saturday,1,26
19,2019-04-13,7163,2,20,2019,4,April,13,5,Saturday,1,15
20,2019-11-30,1323,22,1,2019,11,November,30,5,Saturday,1,48
28,2019-04-20,5501,16,1,2019,4,April,20,5,Saturday,1,16
...,...,...,...,...,...,...,...,...,...,...,...,...
973,2018-09-08,547,4,19,2018,9,September,8,5,Saturday,1,36
982,2019-06-22,354,13,2,2019,6,June,22,5,Saturday,1,25
984,2019-11-23,528,0,3,2019,11,November,23,5,Saturday,1,47
985,2018-12-08,5486,14,1,2018,12,December,8,5,Saturday,1,49
991,2019-01-12,5780,0,2,2019,1,January,12,5,Saturday,1,2

#### Extract quarter

In [101]:
date['quarter'] = date['date'].dt.quarter

In [106]:
date.sample()

,date,product_id,city_id,orders,year,month,month_name,day,dayofweek,dayname,weekend,week,quarter,semester
314,2018-10-06,4845,22,4,2018,10,October,6,5,Saturday,1,40,4,2

#### Extract semester

In [105]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1,2)

#### Extract week of the year

In [99]:
date['week'] = date['date'].dt.week

C:\Users\dell\AppData\Local\Temp\ipykernel_5332\2051679208.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['week'] = date['date'].dt.week

#### Extract time elapsed between dates

In [107]:
import datetime

In [108]:
today = datetime.datetime.today()

In [109]:
today

datetime.datetime(2024, 7, 5, 11, 20, 2, 214004)

In [111]:
today-date['date'] #XXX days HH:MM:SS.mmmmm

0     1669 days 11:20:02.214004
1     2151 days 11:20:02.214004
2     2082 days 11:20:02.214004
3     1784 days 11:20:02.214004
4     2007 days 11:20:02.214004
                 ...
995   2097 days 11:20:02.214004
996   2038 days 11:20:02.214004
997   1886 days 11:20:02.214004
998   1951 days 11:20:02.214004
999   1725 days 11:20:02.214004
Name: date, Length: 1000, dtype: timedelta64[ns]

In [112]:
(today - date['date']).dt.days

0      1669
1      2151
2      2082
3      1784
4      2007
       ...
995    2097
996    2038
997    1886
998    1951
999    1725
Name: date, Length: 1000, dtype: int64

In [117]:
# months passed
np.round((today -date['date']) /np.timedelta64(1,'M'),0)

0      55.0
1      71.0
2      68.0
3      59.0
4      66.0
       ...
995    69.0
996    67.0
997    62.0
998    64.0
999    57.0
Name: date, Length: 1000, dtype: float64

### Working with time column

In [121]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [120]:
time['date'] = pd.to_datetime(time['date'])

#### Extract hr, min, sec

In [122]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

#### Extract time part

In [135]:
time['date'].dt.time

0      00:50:00
1      23:40:00
2      00:21:00
3      00:31:00
4      23:11:00
         ...
995    00:50:00
996    23:14:00
997    23:37:00
998    23:34:00
999    23:25:00
Name: date, Length: 1000, dtype: object

#### time difference

In [125]:
today - time['date']

0     3855 days 10:30:02.214004
1     3719 days 11:40:02.214004
2     4205 days 10:59:02.214004
3     3507 days 10:49:02.214004
4     3904 days 12:09:02.214004
                 ...
995   4494 days 10:30:02.214004
996   3815 days 12:06:02.214004
997   4280 days 11:43:02.214004
998   4396 days 11:46:02.214004
999   3668 days 11:55:02.214004
Name: date, Length: 1000, dtype: timedelta64[ns]

In [132]:
(today - time['date'])/np.timedelta64(1,'s') #in secs

0      3.331098e+08
1      3.213636e+08
2      3.633515e+08
3      3.030437e+08
4      3.373493e+08
           ...
995    3.883194e+08
996    3.296596e+08
997    3.698342e+08
998    3.798568e+08
999    3.169581e+08
Name: date, Length: 1000, dtype: float64

In [133]:
(today - time['date'])/np.timedelta64(1,'h') # in hrs

0       92530.500615
1       89267.667282
2      100930.983948
3       84178.817282
4       93708.150615
           ...
995    107866.500615
996     91572.100615
997    102731.717282
998    105515.767282
999     88043.917282
Name: date, Length: 1000, dtype: float64

In [134]:
(today - time['date'])/np.timedelta64(1,'m') # in mins

0      5.551830e+06
1      5.356060e+06
2      6.055859e+06
3      5.050729e+06
4      5.622489e+06
           ...
995    6.471990e+06
996    5.494326e+06
997    6.163903e+06
998    6.330946e+06
999    5.282635e+06
Name: date, Length: 1000, dtype: float64